# ImportSketchup1

## Description
Import a sketch up file.

```pascal
FUNCTION ImportSketchup1(
				filePath    : STRING;
				doSingleSym : BOOLEAN): BOOLEAN;
```

```python
def vs.ImportSketchup1(filePath, doSingleSym):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|filePath|STRING|   |
|doSingleSym|BOOLEAN|   |

## Version
Availability: from Vectorworks 2014

## Category
* File I@O